'''def allowed(my_age):
    girls_age = my_age / 2 + 7
    return girls_age

my_limit = allowed(27)
joe_limit = allowed(49)
print("can date", my_limit, "or older")
print("can date", joe_limit, "or older")'''

# homework
# Создать список от 15 до 60 лет и написать формулу
# которая вычисляет лимит, в пределах которого
# люди этих возрастов могут жить вместе
